---
kind: method
id: M:Autodesk.Revit.DB.ProjectLocationSetIterator.#ctor
source: html/a51ebdf4-9e5c-ad17-7da5-7fc804ebebd8.htm
---
# Autodesk.Revit.DB.ProjectLocationSetIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public ProjectLocationSetIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.